// 1) შექმენით პროგრამა კინო თეატრისთვის. თითოეულ სპექტაკლზე იყიდე ბილეთი, სულ არის 300 ბილეთი. თითოეულ ჯერზე როდესაც ბილეთი გაიყიდა გამოიტანეთ console-ში "გაიყიდა ბილეთი" და როდესაც უკვე ბილეთები გათავდება გამოიტანეთ "ბოდიშით, მეტი ბილეთი აღარ გვაქვს"
let tickets = 300
while (tickets >= 0){
    console.log("გაიყიდა ბილეთი")
    tickets--
}
console.log("ბოდიშით, მეტი ბილეთი აღარ გვაქვს")
/* 2) გააკეთეთ პირველი დავალება ორივე for და while loop - ით */ console.log('-------------------------------------------------------------------------------------------')
for (let i = 300; i > 0; i--){
    console.log("გაიყიდა ბილეთი")
}
console.log("ბოდიშით, მეტი ბილეთი აღარ გვაქვს")
