// 1) მასივების რეფერენსი

// პირობა: შექმენი ახალი მასივი, რომელიც უბრალოდ „სარკეა“ საწყისის. დაამატე ახალი ელემენტი და ნახე ორივე მასივი როგორ შეიცვალა.
let arr = [1, 2, 3];
let newArr = arr;
// 2) spread ოპერატორი მასივზე

// პირობა: შექმენი ახალი მასივი, რომელიც შეიცავს ძველს + დამატებით ელემენტებს. დაამატე კიდევ ერთი ელემენტი ახალ მასივში და ნახე ძველი მასივი არ შეცვლილა.
let arr2 = [1, ...arr];
arr2.push(4);
console.log(arr);
console.log(arr2);
// 3) ობიექტების რეფერენსი

// პირობა: შექმენი ახალი ობიექტი, რომელიც უბრალოდ რეფერენსია ძველ ობიექტზე. დაამატე ახალი თვისება ახალ ობიექტში და ნახე ძველი ობიექტი როგორ შეიცვალა.
let obj = {
    name: "john", 
    age: 25 
};
let newObj = obj;
newObj.city = "tbilisi";
console.log(obj);
console.log(newObj);
// 4) spread ოპერატორი ობიექტზე

// პირობა: შექმენი ახალი ობიექტი, რომელიც კოპირებს ძველ ობიექტს და დაამატე ახალი თვისება. შეამოწმე, რომ ძველი ობიექტი არ შეცვლილა.
let newObj2 = {...obj, 
    country: "georgia" };
console.log(obj);
console.log(newObj2);
// 5) ელემენტების სწრაფი დამატება

// პირობა: გამოიყენე spread ოპერატორი, რომ ძველი მასივი გადააკეთო ახალში და დაამატო რამდენიმე ახალი ელემენტი ერთ ნაბიჯში.
let arr3 = [...arr2, 5, 6, 7];
console.log(arr3);