#sequencing --> თანმიმდევრობა

#interation --> გამეორება

#selection --> არჩევა

#flowcharts --> ალგორითმის ვიზუალიზაცია/ნახატად წარმოდგება

#pseudocode --> ფსეუდო კოდი არის გამარტივებული ენა, რომელიც ოდნავ ახლის პროგრამირობას ენასთან

#sequencing --> თანმიმდევრობა მაგ: ფოლდერები goa_course-ში
#selection --> არჩევა მაგ: მივდივარ მაღაზიაში და მაქ 2 ლარი და მაქ არჩევა ვიყიდო მინერალური ან ლიმონადი
#interation --> გამეორება მაგ: ყოველ დღე ვიმეორებთ გრაფიკს რომელიც დავწერეთ გუშინ
#algorith --> ინსტრუქცია რომელიც კომპიუტერი აუცილებლად უნდა შეასრულოს