// 1)შექმენით  რიცხვების სია, და მასში დააჯამეთ რიცხვები reduce ის გამოყენებით
let numbers = [1, 2, 3, 4, 5]
let sum = numbers.reduce((a, b) => a + b)
console.log(sum)
// 2)შექმენით სია სადაც იქნება ბევრი სტრინგი, ეს სტრინგეი უნდა იყოს განაწილებული რომ სიტყვა გამოვიდეს

// მაგ: ['n', 'i', 'g', 'g', 'e', 'r']

// და შეემდეგ reduce ით ეს სტრინგები გააერთიანდე

let idk = ['n', 'i', 'g', 'g', 'e', 'r']
let dd = idk.reduce((a, b) => a + b)
console.log(dd)

// 3)შექმენით სია რიცხვებით სავსე, და შემდეგ ამ სიის  საშუალო არითმეტიკული გამოითვალეთ 
let nums = [1, 2, 3, 4, 5]
let average = nums.reduce((a, b) => a + b) / nums.length
console.log(average)
// ჯამი გაყოფილი სიგრძეზე