print("apple")# str
print("tomato")# str
print("cucumber")# str
print(10)# int
print(100)# int
print(1000)# int
print(1.7)# float
print(9.4)# float
print(0.7)# float

#data type==> მონაცემთა ტიპები

# int() --> ინტეჯერი არის ნებისმიერი მთელი რიცხვი რომელიც არ იწერება ბრჭყალებში. მაგ: 60,34,844,1285,18555...
# str() --> სტრინგი არის ნებისმიერი ტექსტი და აგრეთვე ნებისმიერი მნიშვნელობა მოთავსებული ბრჭყალებში. მაგ: "hello world!"","carrot","Goathebest","9","16","7"...
# float() --> ფლოატი არის ნებისმიერი ათწილადი/წერტილიანი რიცხვი. მაგ: 10.5,0,7,1,9...

# + შეკრება
# - გამოკლება
# / გაყოფა
# * გამრავლება

print(10 + 12)
print(49 + 239)
print(29 - 12)
print(120 - 74)
print(18 / 2)
print(90 / 4)
print(14 * 3)
print(24 * 4)

print("გამარჯობა" + "მე" + "მქვია" + "გიორგი" )